/*
 PFActionDescriptions.strings
 PFAssistive Framework 3.3.0
 Copyright 2003-2013 Bill Cheeseman. Used by permission.
 All rights reserved.
*/

/* This file was originally based on Apple's ActionDescriptions.strings resource in the HIServices subframework of the ApplicationServices framework, which is no longer human readable. These key-value pairs can be used to provide localizable human-readable descriptions for actions implemented in the accessibility API. This file should be used only for localizable human-readable descriptions in a client application's GUI; it should not be used to provide AppleScript terminology. See AXActionConstants.h in the HIServices headers and NSAccessibility.h in the AppKit headers to see which keys are actually implemented. */

/* Localized action descriptions are normally obtained by calling the accessibility API's AXUIElementCopyActionDescription function, which gets them from Apple's ActionDescriptions.strings resource. However, in Mac OS X 10.2.x Jaguar, that resource contains obsolete keys and therefore returns a key instead of a value in some cases. The PFAssistive framework therefore used this PFActionDescriptions.strings file to provide correct descriptions in Jaguar. With every new release of Mac OS X, this file will be checked for compatibility with any changes to Apple's AXActionConstants.h and NSAccessibility.h files instead, and against the AccessibilityDescriptions.plist file introduced in OS X 10.8 Mountain Lion (but which Apple does not necessarily keep up to date). */

/* Starting with Mac OS X 10.3 Panther, the PFAssistive framework uses Apple's ActionDescriptions.strings resource by calling AXUIElementCopyActionDescription. We nevertheless continue to add new action descriptions here to document changes and for potential future use. */

/* Mac OS X 10.3 Panther introduced a new bug, where the AXRaise action was left out of ActionDescriptions.strings. To deal with the Panther bug, we checked for this bug specifically and referred to this PFActionDescriptions.strings resource only for the AXRaise key. This Panther bug was fixed in Mac OS X 10.4 Tiger. */

/* This file is localizable. Localizers should copy the localizations in Apple's localized ActionDescriptions.strings files (if available and correct) in order to maximize consistency. */

/* accessibility action description */
"AXAccept" = "accept"; /* added 1.2b2 */
"AXCancel" = "cancel";
"AXCancelMenuTracking" = "cancels menu tracking"; /* removed in Tiger */
"AXConfirm" = "confirm";
"AXDecrement" = "decrement";
"AXDelete" = "delete"; /* added 1.4b2; new in Tiger, but removed in a dot release */
"AXIncrement" = "increment";
"AXPick" = "pick"; /* deprecated in Tiger and marked private in AccessibilityDefinitions.plist */
"AXPickMenuItem" = "selects a menu item"; /* removed in Tiger */
"AXPress" = "press"; /* revised 1.2b2 to show "press" as primary accessibility term */
"AXRaise" = "raise"; /* added 1.2b2 */
"AXShowAlternateUI" = "show alternate UI"; /* added 3.3.0b1 for Mavericks */
"AXShowDefaultUI" = "show default UI"; /* added 3.3.0b1 for Mavericks */
"AXShowMenu" = "show menu"; /* added 1.4b1; new in Tiger */
